Samsung/mTower/arch/cortex-m23/m2351/src/numaker_pfm_m2351/nonsecure/main_ns.c
/**
 * @file        arch/arm/m2351/src/numaker_pfm_m2351/nonsecure/main_ns.c
 * @brief       Provides functionality to start, initialize, load and execute
 *              FreeRTOS tasks
 *
 * @copyright   Copyright (c) 2019 Samsung Electronics Co., Ltd. All Rights Reserved.
 * @author      Taras Drozdovskyi t.drozdovsky@samsung.com
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/* Included Files. */
#include "string.h"

#include <arm_cmse.h>
#include "M2351.h"
#include "version.h"
#include "config.h"

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"

/* Demo application include. */

/* Pre-processor Definitions. */
/* All C pre-processor macros are defined here. */
#define NORMAL  "\e[0m"
#define BLACK   "\e[0;30m"
#define RED     "\e[0;31m"
#define GREEN   "\e[0;32m"
#define YELLOW  "\e[0;33m"
#define BLUE    "\e[0;34m"
#define MAGENTA "\e[0;35m"
#define CYAN    "\e[0;36m"
#define GRAY    "\e[0;37m"

#define BBLACK   "\e[40m"
#define BRED     "\e[41m"
#define BGREEN   "\e[42m"
#define BYELLOW  "\e[43m"
#define BBLUE    "\e[44m"
#define BMAGENTA "\e[45m"
#define BCYAN    "\e[46m"
#define BGRAY    "\e[30;47m"

#define BUFFER_SIZE 700

/* Private Types. */
/* Any types, enums, structures or unions used by the file are defined here. */
typedef int32_t (*funcptr)(uint32_t);

/* Private Function Prototypes. */
/* Prototypes of all static functions in the file are provided here. */
static void prvSetupHardware( void );

static void DEBUG_PORT_Init(void);

/* NonSecure functions used for callbacks */
static int32_t NonSecure_LED_On(uint32_t num);
static int32_t NonSecure_LED_Off(uint32_t num);

static void teeLedBlinkTask( void *pvParameters );
static void clnSrvTask( void *pvParameters );
static void menuTask( void *pvParameters );
#ifdef CONFIG_APPS_HW_SECURITY_EXCEPTION_EXAMPLE
void menu_security_exception_example_ns(void);
#endif
#ifdef CONFIG_APPS_SPY
static void spyAppTask( void /**pvParameters*/ );
#endif
static void teeHelloWorldTask( void *pvParameters );
static void teeAESTask( void *pvParameters );
static void teeHotpTask( void *pvParameters );
static void teeTestSuiteTask( void *pvParameters );


/* Private Data. */
/* All static data definitions appear here. */


/* Public Data. */
/* All data definitions with global scope appear here. */


/* Extern Function Prototypes */
/* CMSIS clock configuration function. */
extern void SystemCoreClockUpdate( void );

extern int tee_hello_world(void);
extern int tee_aes(void);
extern int tee_hotp(void);
extern int tee_tests(void);

/* NonSecure Callable Functions from Secure Region */
extern int32_t Secure_func(void);
extern int32_t Secure_LED_On_callback(int32_t (*)(uint32_t));
extern int32_t Secure_LED_Off_callback(int32_t (*)(uint32_t));
extern int32_t Secure_LED_On(uint32_t num);
extern int32_t Secure_LED_Off(uint32_t num);

/* Private Functions. */

/**
 * @brief         prvSetupHardware - performs any application specific hardware
 *                configuration. The clocks, memory, etc. are configured before
 *                main() is called..
 *
 * @param         None
 *
 * @returns       None
 */
static void prvSetupHardware( void )
{
  DEBUG_PORT_Init();
}

/**
 * @brief         DEBUG_PORT_Init - performs initialization of UART.
 *
 * @param         None
 *
 * @returns       None
 */
static void DEBUG_PORT_Init(void)
{
  DEBUG_PORT->BAUD = UART_BAUD_MODE2 | UART_BAUD_MODE2_DIVIDER(__HIRC, 115200);
  DEBUG_PORT->LINE = UART_WORD_LEN_8 | UART_PARITY_NONE | UART_STOP_BIT_1;
}

/* NonSecure functions used for callbacks */

/**
 * @brief         NonSecure_LED_On - callback for LED On call by Secure.
 *
 * @param         None
 *
 * @returns       None
 */
static int32_t NonSecure_LED_On(uint32_t num)
{
  (void) num;

  printf("Nonsecure LED On call by Secure\n");
  PC0_NS = 0;
  return 0;
}

/**
 * @brief         NonSecure_LED_Off - callback for LED Off call by Secure.
 *
 * @param         None
 *
 * @returns       None
 */
static int32_t NonSecure_LED_Off(uint32_t num)
{
  (void) num;

  printf("Nonsecure LED Off call by Secure\n");
  PC0_NS = 1;
  return 0;
}

/**
 * @brief         menuTask1 - .
 *
 * @param         None
 *
 * @returns       None
 */
static void menuTask(void *pvParameters)
{
  /* Define a buffer that is large enough to hold the generated table.  In most
   * cases the buffer will be too large to allocate on the stack, hence in this
   * example it is declared static. */

  static char cBuffer[BUFFER_SIZE];

  (void) pvParameters;

  char ch;
  do {
    printf("\n+- Menu ----------------------------------------------------+\n");
#ifdef CONFIG_APPS_HELLO_WORLD
    printf("| [1] - Run Hello World (Ported from OP-TEE, pseudo TA)     |\n");
#endif
#ifdef CONFIG_APPS_AES
    printf("| [2] - Run AES (Ported from OP-TEE, user TA)               |\n");
#endif
#ifdef CONFIG_APPS_HOTP
    printf("| [3] - Run HOTP (Ported from OP-TEE, user TA)              |\n");
#endif
    printf("| [4] - Get FreeRTOS Task List                              |\n");
#ifdef CONFIG_APPS_TEST
    printf("| [5] - Run Test Suite for GP TEE Client & Internal API     |\n");
#endif
#ifdef CONFIG_APPS_HW_SECURITY_EXCEPTION_EXAMPLE
    printf("| [6] - Run H/W Security exception example (from non-secure)|\n");
    printf("| [7] - Run H/W Security exception example (from secure)    |\n");
#endif
#ifdef CONFIG_APPS_SPY
    printf("| [8] - Run spy app that trying to get protected data       |\n");
#endif
    printf("+-----------------------------------------------------------+\n");

    printf("\n[%c]\n", ch = getchar());

