Samsung/mTower/arch/cortex-m23/m2351/src/numaker_pfm_m2351/nonsecure/main_ns.c
    switch (ch) {
#ifdef CONFIG_APPS_HELLO_WORLD
      case '1':
        xTaskCreate(teeHelloWorldTask,  /* The function that implements the task. */
        "tHelloWorld",           /* The text name assigned to the task - for debug only as it is not used by the kernel. */
        256,                  /* The size of the stack to allocate to the task. */
        (void *) NULL,        /* The parameter passed to the task - just to check the functionality. */
        tskIDLE_PRIORITY + 2, /* The priority assigned to the task. */
        NULL);
        break;
#endif
#ifdef CONFIG_APPS_AES
      case '2':
        xTaskCreate(teeAESTask, /* The function that implements the task. */
        "tAES",          /* The text name assigned to the task - for debug only as it is not used by the kernel. */
        256,                  /* The size of the stack to allocate to the task. */
        (void *) NULL,        /* The parameter passed to the task - just to check the functionality. */
        tskIDLE_PRIORITY + 2, /* The priority assigned to the task. */
        NULL);
        break;
#endif
#ifdef CONFIG_APPS_HOTP
      case '3':
        xTaskCreate(teeHotpTask, /* The function that implements the task. */
        "tHOTP",          /* The text name assigned to the task - for debug only as it is not used by the kernel. */
        256,                  /* The size of the stack to allocate to the task. */
        (void *) NULL,        /* The parameter passed to the task - just to check the functionality. */
        tskIDLE_PRIORITY + 2, /* The priority assigned to the task. */
        NULL);
        break;
#endif
      case '4':
        /* Obtain the current tick count. */
        printf("\nAuto-reload timer callback executing = %d\n", xTaskGetTickCount());

        /* Pass the buffer into vTaskList() to generate the table of information. */
        vTaskList(cBuffer);
        portDISABLE_INTERRUPTS();
        printf("%s\n", cBuffer);
        portENABLE_INTERRUPTS();
        break;
#ifdef CONFIG_APPS_TEST
        case '5':
        xTaskCreate( teeTestSuiteTask,  /* The function that implements the task. */
            "tTestSuite",               /* The text name assigned to the task - for debug only as it is not used by the kernel. */
            256,                        /* The size of the stack to allocate to the task. */
            ( void * ) NULL,            /* The parameter passed to the task - just to check the functionality. */
            tskIDLE_PRIORITY + 2,       /* The priority assigned to the task. */
            NULL );
        break;
#endif
#ifdef CONFIG_APPS_HW_SECURITY_EXCEPTION_EXAMPLE
      case '6':
        menu_security_exception_example_ns();
        break;
      case '7':
        portDISABLE_INTERRUPTS();
        Secure_func();
        portENABLE_INTERRUPTS();
        break;
#endif
#ifdef CONFIG_APPS_SPY
        case '8':
        spyAppTask();
        break;
#endif
      default:
        break;
    }
    taskYIELD();
  } while (1);
}

#ifdef CONFIG_APPS_SPY
const char app_protected[] =
    "\n ########################################"
    "\n ## Data protected by TrustZone        ##"
    "\n ########################################"
    "\n ## Non-secure      |  "GREEN"Secure          "NORMAL"##"
    "\n ## ##############  |  "GREEN"############### "NORMAL"##"
    "\n ## # Spy App    #"RED"--X->"GREEN"# Protected   # "NORMAL"##"
    "\n ## ##############  |  "GREEN"# data ######## "NORMAL"##"
    "\n ##                 |         "GREEN"|        "NORMAL"##"
    "\n ## ##############  |  "GREEN"############### "NORMAL"##"
    "\n ## # App        #  |  "GREEN"# Trusted App # "NORMAL"##"
    "\n ## ##############  |  "GREEN"######### "YELLOW"#########"
    "\n ##        "GREEN"|        "NORMAL"|         "GREEN"| "YELLOW"##       ##"
    "\n ## ##############  |  "GREEN"####### "YELLOW"## "GREEN"####    "YELLOW"##"
    "\n ## # TEE CL API #"GREEN"----># TEE IN"YELLOW"##"GREEN"API #    "YELLOW"##"
    "\n ## ##############  |  "GREEN"####### "YELLOW"## "GREEN"####    "YELLOW"##"
    "\n ##                 |         "YELLOW"###############"
    "\n ## ##############  |  "GREEN"###### "YELLOW"######   ######"
    "\n ## # FreeRTOS   #  |  "GREEN"# Reso "YELLOW"####### #######"
    "\n ## ##############  |  "GREEN"###### "YELLOW"####### #######"
    "\n ############################ "YELLOW"###############\n";

const char app_description[] =
    "ARM TrustZone technology protects data in secure memory\n"
    "from unauthorized access from Non-Secure app.\n"
    "Spy app cannot access data in secure memory.\n"
    "\nHowever, application can use special GP TEE API calls\n"
    "to perform operations with data in secure memory.\n"
    "\nFor example, data can be sent into secure memory,\n"
    "encrypted there and returned to non-secure memory,\n"
    "with encryption keys never leaving secure memory.\n";

const char spy_description[] =
    "Demonstration of unauthorized access to data in secure\n"
    "memory. When such access is detected,\n"
    "system generates a security hard fault and enters\n"
    "endless loop, requiring restart to continue operation.\n";

const char spy[] =
"\n                      MMMMMMMMMMMM-"
"\n                  .hMMMMMMMMMMMMMMMmo`"
"\n                `oMMMMMMMMMMMMMMMMMMMm+"
"\n               `MMh- `.MMMMMMMMMMM/-`/MM"
"\n               sMs`                   oM+"
"\n              .NN MMMMMMMm    mMMMMMMm Mm"
"\n              -MMMMP     qMMMMMp     qMMMM`"
"\n              .MMMMc     dMMMMMc     dMMMM`"
"\n               mM MMMMMMMp    qdMMMMMMh Mn`"
"\n                dMM`                 +MMp"
"\n           .dMMMMMMs-    ======    :hMMMMMMm."
"\n          hNMMMMMMMMMh+-         odMMMMMMMMMmy"
"\n        mMMMMMMMMMMMMMMMmddhhdmmMMMMMMMMMMMMMMMh "
"\n       mMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMh "
"\n     -mMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMh "
"\n   `mMMMMMo                                 sMMMMMh "
"\n   `dMMMMM/ "YELLOW"MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"NORMAL" oMMMMMy "
"\n   yMMMMMM/ "YELLOW"MM----------------------------MM"NORMAL"  sMMMMMMo"
"\n  /MMMMMMMs "YELLOW"oM- "GREEN"101010101011101010010100"YELLOW" -MM"NORMAL"  hMMMMMMN-"
"\n `mMMMMMMMd "YELLOW"/M- "GREEN"001010101010101000010101"YELLOW" -M."NORMAL"  NMMMMMMMd"
"\n +MMMMMMMMN`"YELLOW".M- "GREEN"101010101010101000010101"YELLOW" -M`"NORMAL" .MMMMMMMMM:"
"\n dMMMMMMMMM."YELLOW"`N- "GREEN"101011101000100011010100"YELLOW" -N"NORMAL"  /MMMMMMMMMs"
"\n yMMMMMMMMM/ "YELLOW"hM "GREEN"110101010111010101011011"YELLOW" Mh"NORMAL"  oMMMMMMMMMo"
"\n `oNMMMMMMMs "YELLOW"sM "GREEN"111101000101011010101111"YELLOW" Mh"NORMAL" hMMMMMMMm+"
"\n   `+hNMMMMd "YELLOW"/MM-----------------------MMM"NORMAL" -MMMMNy/`"
"\n      `:sdNm`"YELLOW".MMMMMMMMMMMMMMMMMMMMMMMMMMMN`"NORMAL".NNho:`"
"\n          `-` "YELLOW"MMMMMMMMMMMMMMMMMMMMMMMMMMMM "NORMAL"`-`"
"\n "
"\n              MMMMMMMMMMMMMMMMMMMMMMMMMMM/\n";
/**
 * @brief         spyAppTask - .
 *
 * @param         None
 *
 * @returns       None
 */
static void spyAppTask( void /**pvParameters*/ )
{
//  (void)pvParameters;
  printf("%s\n", app_protected);
  vTaskDelay( (TickType_t)1000 / portTICK_PERIOD_MS);
  printf("%s\n", app_description);
  vTaskDelay( (TickType_t)9000 / portTICK_PERIOD_MS);

