Samsung/mTower/arch/cortex-m23/m2351/src/numaker_pfm_m2351/nonsecure/main_ns.c
//  printf("\e[2J");
//  UART_WAIT_TX_EMPTY((UART_T *)DEBUG_PORT);
  printf("%s\n", spy);
  vTaskDelay( (TickType_t)2000 / portTICK_PERIOD_MS);
  printf("\n%s\n", spy_description);
  vTaskDelay( (TickType_t)9000 / portTICK_PERIOD_MS);
  M32(0x20000000);

  do {
  } while (1);
}
#endif

/**
 * @brief         testTask1 - .
 *
 * @param         None
 *
 * @returns       None
 */
static void teeLedBlinkTask( void *pvParameters )
{
  const TickType_t xDelay = 500 / portTICK_PERIOD_MS;

  (void)pvParameters;

  do {
    portDISABLE_INTERRUPTS();
    Secure_LED_On(6u);
    portENABLE_INTERRUPTS();
    vTaskDelay( xDelay );
    portDISABLE_INTERRUPTS();
    Secure_LED_Off(6u);
    portENABLE_INTERRUPTS();
    vTaskDelay( xDelay );
  } while (1);
}

/**
 * @brief         clnSrvTask - cleaning service.
 *
 * @param         None
 *
 * @returns       None
 */
static void clnSrvTask( void *pvParameters )
{
  const TickType_t xDelay = 1000 / portTICK_PERIOD_MS;

  (void)pvParameters;

  do {
    vTaskPrioritySet( xTaskGetIdleTaskHandle(), uxTaskPriorityGet(xTaskGetCurrentTaskHandle()));
//    taskYIELD();
    vTaskDelay( xDelay );
    vTaskPrioritySet( xTaskGetIdleTaskHandle(), tskIDLE_PRIORITY);
    vTaskDelay( xDelay );
  } while (1);
}

#ifdef CONFIG_APPS_HELLO_WORLD
/**
 * @brief         teeHelloWorldTask - .
 *
 * @param         None
 *
 * @returns       None
 */
static void teeHelloWorldTask( void *pvParameters )
{
//  const TickType_t xDelay = 2000 / portTICK_PERIOD_MS;

  (void)pvParameters;

  do {
    portDISABLE_INTERRUPTS();
    printf("TEE test: Hello_world\n");
    tee_hello_world();
    portENABLE_INTERRUPTS();
//    vTaskDelay( xDelay );
    vTaskDelete(NULL);
  } while (1);
}
#endif

#ifdef CONFIG_APPS_AES
/**
 * @brief         teeTest - .
 *
 * @param         None
 *
 * @returns       None
 */
static void teeAESTask( void *pvParameters )
{
//  const TickType_t xDelay = 2000 / portTICK_PERIOD_MS;

  (void)pvParameters;

  do {
    portDISABLE_INTERRUPTS();
    printf("TEE test: AES\n");
    tee_aes();
    portENABLE_INTERRUPTS();
    vTaskDelete(NULL);
//    vTaskDelay( xDelay );
  } while (1);
}
#endif

#ifdef CONFIG_APPS_HOTP
/**
 * @brief         teeTest4 - .
 *
 * @param         None
 *
 * @returns       None
 */
static void teeHotpTask( void *pvParameters )
{
//  const TickType_t xDelay = 2000 / portTICK_PERIOD_MS;

  (void)pvParameters;

  do {
    portDISABLE_INTERRUPTS();
    printf("TEE test: HOTP\n");
    tee_hotp();
    portENABLE_INTERRUPTS();
    vTaskDelete(NULL);
//    vTaskDelay( xDelay );
  } while (1);
}
#endif // CONFIG_APPS_HOTP

#ifdef CONFIG_APPS_TEST
/**
 * @brief         teeTest4 - .
 *
 * @param         None
 *
 * @returns       None
 */
static void teeTestSuiteTask( void *pvParameters )
{
//  const TickType_t xDelay = 2000 / portTICK_PERIOD_MS;

  (void)pvParameters;

  do {
    portDISABLE_INTERRUPTS();
    printf("\nTEE test: test suite\n");
    tee_tests();
    portENABLE_INTERRUPTS();
    vTaskDelete(NULL);
//    vTaskDelay( xDelay );
  } while (1);
}
#endif // CONFIG_APPS_TEST

/* Public Functions. */
/**
 * @brief         vApplicationMallocFailedHook - vApplicationMallocFailedHook()
 *                will only be called if configUSE_MALLOC_FAILED_HOOK is set to
 *                1 in FreeRTOSConfig.h.  It is a hook function that will get
 *                called if a call to pvPortMalloc() fails. pvPortMalloc() is
 *                called internally by the kernel whenever a task, queue, timer
 *                or semaphore is created.  It is also called by various parts
 *                of the demo application.  If heap_1.c or heap_2.c are used,
 *                then the size of the heap available to pvPortMalloc() is
 *                defined by configTOTAL_HEAP_SIZE in FreeRTOSConfig.h, and the
 *                xPortGetFreeHeapSize() API function can be used to query the
 *                size of free heap space that remains (although it does not
 *                provide information on how the remaining heap might be
 *                fragmented).
 *
 * @param         None
 *
 * @returns       None
 */
void vApplicationMallocFailedHook( void )
{
  taskDISABLE_INTERRUPTS();
  for( ;; );
}

/**
 * @brief         vApplicationIdleHook - vApplicationIdleHook() will only be
 *                called if configUSE_IDLE_HOOK is set to 1 in FreeRTOSConfig.h.
 *                It will be called on each iteration of the idle task.  It is
 *                essential that code added to this hook function never attempts
 *                to block in any way (for example, call xQueueReceive() with a
 *                block time specified, or call vTaskDelay()).  If the
 *                application makes use of the vTaskDelete() API function (as
 *                this demo application does) then it is also important that
 *                vApplicationIdleHook() is permitted to return to its calling
 *                function, because it is the responsibility of the idle task
 *                to clean up memory allocated by the kernel to any task that
 *                has since been deleted.
 *
 * @param         None
 *
 * @returns       None
 */
void vApplicationIdleHook( void )
{
  ;
}

/**
 * @brief         vApplicationStackOverflowHook - .
 *
 * @param         None
 *
 * @returns       None
 */
void vApplicationStackOverflowHook( TaskHandle_t pxTask, char *pcTaskName )
{
  ( void ) pcTaskName;
  ( void ) pxTask;

  /* Run time stack overflow checking is performed if
  configCHECK_FOR_STACK_OVERFLOW is defined to 1 or 2.  This hook
  function is called if a stack overflow is detected. */
  taskDISABLE_INTERRUPTS();

  //__BKPT();

    printf("Stack overflow task name=%s\n", pcTaskName);

  for( ;; );
}

/**
 * @brief         vApplicationTickHook - This function will be called by each
 *                tick interrupt if configUSE_TICK_HOOK is set to 1 in
 *                FreeRTOSConfig.h.  User code can be added here, but the tick
 *                hook is called from an interrupt context, so code must not
 *                attempt to block, and only the interrupt safe FreeRTOS API
 *                functions can be used (those that end in FromISR()).
 *
 * @param         None
 *
 * @returns       None (function is not supposed to return)
 */
void vApplicationTickHook( void )
{
  ;
}

