Samsung/mTower/arch/cortex-m23/m2351/src/numaker_pfm_m2351/nonsecure/main_ns.c
#ifdef CONFIG_APPS_HW_SECURITY_EXCEPTION_EXAMPLE
void menu_security_exception_example_ns(void)
{
  char ch;
  int temp = 1;

  printf("+----------------------------------------------------------------------+\n");
  printf("| Type  | Range addresses         | Size       | Remarks               |\n");
  printf("+----------------------------------------------------------------------+\n");
  printf("| FLASH | 0x%08X - 0x1007FFFF | 0x%08X | %dk                  |\n", CONFIG_START_ADDRESS_BL33, 0x10080000 - CONFIG_START_ADDRESS_BL33, (0x10080000 - CONFIG_START_ADDRESS_BL33)/1024);
  printf("| RAM   | 0x30008000 - 0x30017FFF | 0x10000    | 64k                   |\n");
  printf("| GPIO  | PC                      |            | Port C is non-secure  |\n");
  printf("| GPIO  | PA,PB                   |            | Port A,B are secure   |\n");
  printf("+----------------------------------------------------------------------+\n\n");

  printf("+----------------------------------------------------------------------+\n");
  printf("| Key | Action                                    | Expected response  |\n");
  printf("+----------------------------------------------------------------------+\n");
  printf("| [1] | Read SRAM secure address 0x30000000       | Hard fault         |\n");
  printf("| [2] | Read SRAM secure address 0x20000000       | Hard fault         |\n");
  printf("| [3] | Read SRAM non-secure address 0x%08X   | Access successful  |\n",(unsigned int)&temp);
  printf("|     | Read SRAM non-secure address 0x%08X   | Hard fault         |\n",(~0x10000000 & (unsigned int)&temp));
  printf("| [4] | Read FLASH secure address 0x00000000      | Hard fault         |\n");
  printf("| [5] | Read FLASH secure address 0x10000000      | Hard fault         |\n");
  printf("| [6] | Read FLASH non-secure address 0x%08X  | Access successful  |\n", CONFIG_START_ADDRESS_BL33);
  printf("|     | Read FLASH non-secure address 0x%08X  | Hard fault         |\n", (CONFIG_START_ADDRESS_BL33 - 0x10000000));
  printf("| [7] | Read GPIO non-secure port PC1_NS          | Access successful  |\n");
  printf("|     | Write 0 GPIO non-secure port by PC1_NS    | Access successful  |\n");
  printf("|     | Write 1 GPIO non-secure port by PC1       | Hard fault         |\n");
  printf("| [8] | Read GPIO secure port PA10_NS             | RAZWI, sec. violat.|\n");
  printf("|     | Write 0 GPIO secure port by PA10_NS       | RAZWI, sec. violat.|\n");
  printf("|     | Write 1 GPIO secure port by PA10          | Hard fault         |\n");
  printf("| [9] | Write 0 to address 0x0 (directly)         | Hard fault         |\n");
  printf("| [a] | Read 0x30018000 address (nonexistent)     | Hard fault         |\n");
  printf("+----------------------------------------------------------------------+\n");

  printf("\n[%c] ", ch = getchar());

  switch (ch) {
    case '1':
      printf("Read SRAM secure address 0x30000000: Hard fault occurs in secure\n");
      M32(0x30000000);
      break;
    case '2':
      printf("Read SRAM secure address 0x20000000: Hard fault occurs in secure\n");
      M32(0x20000000);
      break;
    case '3':
      printf("Read SRAM non-secure address 0x%08X = %08x\n", (unsigned int)&temp, M32(&temp));
      printf("    Read SRAM non-secure address 0x%08X: Hard fault occurs in secure\n", (~0x10000000 & (unsigned int)&temp));
      M32((~0x10000000 & (unsigned int)&temp));
      break;
    case '4':
      printf("Read FLASH secure address 0x00000000: Hard fault occurs in secure\n");
      M32(0x00000000);
      break;
    case '5':
      printf("Read FLASH secure address 0x10000000: Hard fault occurs in secure\n");
      M32(0x10000000);
      break;
    case '6':
      printf("Read FLASH non-secure address 0x%08X = %08x\n", CONFIG_START_ADDRESS_BL33, M32(CONFIG_START_ADDRESS_BL33));
      printf("    Read FLASH non-secure address 0x%08X: Hard fault occurs in secure\n", (CONFIG_START_ADDRESS_BL33 - 0x10000000));
      M32(0x00040000);
      break;
    case '7':
      printf("Read GPIO non-secure port PC1_NS = %d\n", PC1_NS);
      printf("    Write 0 GPIO non-secure port by PC1_NS.");
      PC1_NS = 0;
      printf(" Result: PC1_NS = %d\n", PC1_NS);
      printf("    Write 1 GPIO non-secure port by PC1. Hard fault occurs in secure\n");
      PC1 = 1;
      break;
    case '8':
      printf("Read GPIO secure port PA10_NS = %d. Result: GPIO violation interrupt occurs\n", PA10_NS);
      printf("    Write 1 GPIO secure port by PA10_NS. Result: GPIO violation interrupt occurs\n");
      PA10_NS = 1;
      printf("    Write 1 GPIO secure port by PA10. Hard fault occurs in secure\n");
      PA10 = 1;
      break;
    case '9':
      M32(0x10000000) = 0;
      break;
    case 'a':
      M32(0x30018000);
      break;
    default:
      break;
  }
while(1);
}
#endif
/**
 * @brief         main - entry point of mTower: nFreeRTOS.
 *
 * @param         None
 *
 * @returns       None (function is not supposed to return)
 */
int main( void )
{
  /* Prepare the hardware to run this demo. */
  prvSetupHardware();

  printf("\n\n\t-=mTower v" VERSION "=-  " __DATE__ "  " __TIME__"\n\n");

  printf("+---------------------------------------------+\n");
  printf("|  Nonsecure FreeRTOS (BL33) is running ...   |\n");
  printf("+---------------------------------------------+\n");

  /* Init PC for Nonsecure LED control */
  GPIO_SetMode(PC_NS, BIT1 | BIT0, GPIO_MODE_OUTPUT);

  /* register NonSecure callbacks in Secure application */
  Secure_LED_On_callback(&NonSecure_LED_On);
  Secure_LED_Off_callback(&NonSecure_LED_Off);

  xTaskCreate( menuTask,     /* The function that implements the task. */
        "menu",                /* The text name assigned to the task - for debug only as it is not used by the kernel. */
        768,                    /* The size of the stack to allocate to the task. */
        ( void * ) NULL,        /* The parameter passed to the task - just to check the functionality. */
        tskIDLE_PRIORITY + 2,   /* The priority assigned to the task. */
        NULL );

  xTaskCreate( teeLedBlinkTask,     /* The function that implements the task. */
      "tLedBlink",                /* The text name assigned to the task - for debug only as it is not used by the kernel. */
      256,                    /* The size of the stack to allocate to the task. */
      ( void * ) NULL,        /* The parameter passed to the task - just to check the functionality. */
      tskIDLE_PRIORITY + 2,   /* The priority assigned to the task. */
      NULL );

  xTaskCreate( clnSrvTask,    /* The function that implements the task. */
      "clnSrv",               /* The text name assigned to the task - for debug only as it is not used by the kernel. */
      256,                     /* The size of the stack to allocate to the task. */
      ( void * ) NULL,         /* The parameter passed to the task - just to check the functionality. */
      tskIDLE_PRIORITY + 2,    /* The priority assigned to the task. */
      NULL );

  vTaskStartScheduler();

  /* If all is well, the scheduler will now be running, and the following
  line will never be reached.  If the following line does execute, then
  there was insufficient FreeRTOS heap memory available for the idle and/or
  timer tasks to be created.  See the memory management section on the
  FreeRTOS web site for more details. */
  for( ;; );

  return 0;
}

